Repository: chocoford/ExcalidrawZ
Catalog: ExcalidrawZ/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, ko, nl, pl, pt, ru, th, tr, vi, zh_hans, zh_hant

# tipsShareDetailExportImageContent
source: You can export the content of your canvas as an image directly from the app. - **How to access** Click the **Share** button in the top-right corner of the window. In the share popup, the first option is **Export as Image**. - **Export options** - Export in either light or dark mode - Export with a transparent background - Embed the source file within the image, allowing it to be re-imported and edited later - **Ways to save and use** - Copy the image directly to the clipboard - Save the image to your local device with one click - Drag and drop
de: Du kannst den Inhalt deiner Leinwand direkt aus der App als Bild exportieren. - **Zugriff** Klicke auf die **Teilen**-Schaltfläche in der oberen rechten Ecke des Fensters. Im Teilen-Popup ist die erste Option **Als Bild exportieren**. - **Exportoptionen** - Export in hellem oder dunklem Modus - Export mit transparentem Hintergrund - Die Quelldatei in das Bild einbetten, sodass sie später wieder importiert und bearbeitet werden kann - **Speicher- und Verwendungsmöglichkeiten** - Das Bild direkt in die Zwischenablage kopieren - Das Bild mit einem Klick auf deinem Gerät speichern - Per Drag & Drop verschieben
es: Puedes exportar el contenido de tu lienzo como una imagen directamente desde la app. - **Cómo acceder** Haz clic en el botón **Compartir** en la esquina superior derecha de la ventana. En el panel de compartir, la primera opción es **Exportar como imagen**. - **Opciones de exportación** - Exportar en modo claro u oscuro - Exportar con fondo transparente - Incrustar el archivo fuente dentro de la imagen, permitiendo que se vuelva a importar y editar más tarde - **Formas de guardar y usar** - Copiar la imagen directamente al portapapeles - Guardar la imagen en tu dispositivo local con un solo clic - Arrastrar y soltar
fr: Vous pouvez exporter le contenu de votre canevas en tant qu'image directement depuis l'application. - **Comment y accéder** Cliquez sur le bouton **Partager** en haut à droite de la fenêtre. Dans la fenêtre contextuelle de partage, la première option est **Exporter en tant qu'image**. - **Options d'exportation** - Exporter en mode clair ou sombre - Exporter avec un fond transparent - Intégrer le fichier source dans l'image, ce qui permet de le réimporter et de le modifier ultérieurement - **Façons d'enregistrer et d'utiliser** - Copier l'image directement dans le presse-papiers - Enregistrer l'image sur votre appareil local en un clic - Glisser-déposer
hi: आप अपने कैनवास की सामग्री को ऐप से सीधे इमेज के रूप में निर्यात कर सकते हैं। - **पहुंचने का तरीका** विंडो के ऊपर-दाएँ कोने में **साझा करें** बटन पर क्लिक करें। साझा पॉपअप में, पहला विकल्प **छवि के रूप में निर्यात करें** है। - **एक्सपोर्ट विकल्प** - लाइट या डार्क मोड में निर्यात करें - पारदर्शी पृष्ठभूमि के साथ निर्यात करें - इमेज में स्रोत फ़ाइल एम्बेड करें, ताकि उसे बाद में फिर से इम्पोर्ट करके संपादित किया जा सके - **सेव और उपयोग के तरीके** - इमेज को सीधे क्लिपबोर्ड में कॉपी करें - एक क्लिक में इमेज को अपने स्थानीय डिवाइस पर सेव करें - ड्रैग और ड्रॉप करें
it: Puoi esportare il contenuto della tua tela come immagine direttamente dall'app. - **Come accedere** Clicca sul pulsante **Condividi** nell'angolo in alto a destra della finestra. Nella finestra di condivisione, la prima opzione è **Esporta come immagine**. - **Opzioni di esportazione** - Esporta in modalità chiara o scura - Esporta con uno sfondo trasparente - Incorpora il file sorgente all'interno dell'immagine, permettendone il reimport e la modifica in seguito - **Modalità di salvataggio e utilizzo** - Copia l'immagine direttamente negli appunti - Salva l'immagine sul tuo dispositivo locale con un clic - Trascina e rilascia
ja: キャンバスの内容をアプリから直接画像としてエクスポートできます。 - **アクセス方法** ウィンドウ右上の**共有**ボタンをクリックします。共有ポップアップの最初のオプションが**画像としてエクスポート**です。 - **エクスポートのオプション** - ライトモードまたはダークモードでエクスポート - 透過背景でエクスポート - 画像内にソースファイルを埋め込んで、後で再インポートして編集できるようにする - **保存と利用方法** - 画像を直接クリップボードにコピー - 画像をワンクリックでローカルに保存 - ドラッグ＆ドロップ
ko: 앱에서 캔버스의 내용을 이미지로 직접 내보낼 수 있습니다. - **접근 방법** 창의 오른쪽 상단에 있는 **공유** 버튼을 클릭하세요. 공유 팝업에서 첫 번째 옵션은 **이미지로 내보내기**입니다. - **내보내기 옵션** - 라이트 또는 다크 모드로 내보내기 - 배경을 투명하게 내보내기 - 이미지 안에 원본 파일을 포함하여 나중에 다시 가져와 편집할 수 있게 함 - **저장 및 사용 방법** - 이미지를 클립보드로 바로 복사 - 한 번의 클릭으로 로컬 기기에 이미지 저장 - 드래그 앤 드롭
nl: Je kunt de inhoud van je canvas rechtstreeks vanuit de app als afbeelding exporteren. - **Hoe toegang krijgen** Klik op de knop **Delen** in de rechterbovenhoek van het venster. In de deel-popup is de eerste optie **Exporteren als afbeelding**. - **Exportopties** - Exporteer in lichte of donkere modus - Exporteer met een transparante achtergrond - Sluit het bronbestand in de afbeelding in, zodat het later opnieuw geïmporteerd en bewerkt kan worden - **Manieren om op te slaan en te gebruiken** - Kopieer de afbeelding direct naar het klembord - Sla de afbeelding met één klik op je lokale apparaat op - Sleep en neerzetten
pl: Możesz wyeksportować zawartość swojego płótna jako obraz bezpośrednio z aplikacji. - **Jak uzyskać dostęp** Kliknij przycisk **Udostępnij** w prawym górnym rogu okna. W wyskakującym okienku udostępniania pierwszą opcją jest **Eksport jako obraz**. - **Opcje eksportu** - Eksport w trybie jasnym lub ciemnym - Eksport z przezroczystym tłem - Osadź plik źródłowy w obrazie, umożliwiając jego ponowne zaimportowanie i późniejszą edycję - **Sposoby zapisywania i użycia** - Skopiuj obraz bezpośrednio do schowka - Zapisz obraz na swoim urządzeniu lokalnym jednym kliknięciem - Przeciągnij i upuść
pt: Você pode exportar o conteúdo do seu canvas como uma imagem diretamente pelo app. - **Como acessar** Clique no botão **Compartilhar** no canto superior direito da janela. No popup de compartilhamento, a primeira opção é **Exportar como imagem**. - **Opções de exportação** - Exportar no modo claro ou escuro - Exportar com fundo transparente - Incorporar o arquivo fonte na imagem, permitindo que ele seja reimportado e editado mais tarde - **Formas de salvar e usar** - Copiar a imagem diretamente para a área de transferência - Salvar a imagem no seu dispositivo local com um clique - Arrastar e soltar
ru: Вы можете экспортировать содержимое холста как изображение прямо из приложения. - **Как получить доступ** Нажмите кнопку **Поделиться** в правом верхнем углу окна. В всплывающем окне первым вариантом будет **Экспорт как изображение**. - **Параметры экспорта** - Экспорт в светлом или тёмном режиме - Экспорт с прозрачным фоном - Встраивание исходного файла в изображение, чтобы его можно было повторно импортировать и отредактировать позже - **Способы сохранения и использования** - Копировать изображение прямо в буфер обмена - Сохранить изображение на устройство одним кликом - Перетащить и отпустить
th: คุณสามารถส่งออกเนื้อหาบนผืนผ้าใบของคุณเป็นรูปภาพได้โดยตรงจากแอป。 - **How to access** คลิกปุ่ม **แชร์** ที่มุมบนขวาของหน้าต่าง ในป๊อปอัพการแชร์ ตัวเลือกแรกคือ **ส่งออกเป็นรูปภาพ**。 - **Export options** - ส่งออกได้ทั้งโหมดสว่างและโหมดมืด - ส่งออกด้วยพื้นหลังโปร่งใส - ฝังไฟล์ต้นฉบับไว้ในภาพ ทำให้สามารถนำกลับเข้าและแก้ไขภายหลังได้ - **Ways to save and use** - คัดลอกรูปภาพไปยังคลิปบอร์ดโดยตรง - บันทึกรูปภาพลงอุปกรณ์ของคุณด้วยการคลิกเพียงครั้งเดียว - ลากและวาง
tr: Tuvalinizin içeriğini uygulamadan doğrudan bir görüntü olarak dışa aktarabilirsiniz. - **Erişim nasıl sağlanır** Pencerenin sağ üst köşesindeki **Paylaş** düğmesine tıklayın. Paylaşma açılır penceresinde ilk seçenek **Görüntü olarak dışa aktar**'dır. - **Dışa aktarma seçenekleri** - Açık veya koyu modda dışa aktarın - Şeffaf arka plan ile dışa aktarın - Kaynak dosyayı görüntünün içine gömün, böylece daha sonra yeniden içe aktarılabilir ve düzenlenebilir - **Kaydetme ve kullanım yolları** - Görüntüyü doğrudan panoya kopyalayın - Görüntüyü tek tıkla yerel cihazınıza kaydedin - Sürükle ve bırak
vi: Bạn có thể xuất nội dung khung vẽ (canvas) dưới dạng hình ảnh trực tiếp từ ứng dụng. - **Cách truy cập** Nhấp vào nút **Chia sẻ** ở góc trên bên phải cửa sổ. Trong cửa sổ chia sẻ, tùy chọn đầu tiên là **Xuất dưới dạng hình ảnh**. - **Tùy chọn xuất** - Xuất ở chế độ sáng hoặc tối - Xuất với nền trong suốt - Nhúng tệp nguồn vào trong hình ảnh, cho phép nhập lại và chỉnh sửa sau này - **Cách lưu và sử dụng** - Sao chép hình ảnh trực tiếp vào bộ nhớ tạm (clipboard) - Lưu hình ảnh vào thiết bị cục bộ chỉ với một cú nhấp - Kéo và thả
zh_hans: 您可以直接从应用中将画布内容导出为图片。 - **如何访问** 点击窗口右上角的 **Share（分享）** 按钮。在分享弹窗中，第一个选项是 **Export as Image（导出为图片）**。 - **导出选项** - 可选择亮色或暗色模式导出 - 支持透明背景导出 - 将源文件嵌入图片中，以便日后重新导入并编辑 - **保存与使用方式** - 将图片复制到剪贴板 - 一键将图片保存到本地设备 - 拖放
zh_hant: 你可以直接在應用程式內將畫布內容匯出為影像。 - **如何存取** 點選視窗右上角的 **Share（分享）** 按鈕。在分享彈出視窗中，第一個選項是 **Export as Image（匯出為影像）**。 - **匯出選項** - 可匯出為淺色或深色模式 - 可匯出為透明背景 - 可將原始檔案嵌入影像中，以便日後可重新匯入並編輯 - **儲存與使用方式** - 直接將影像複製到剪貼簿 - 一鍵將影像儲存到本機裝置 - 拖放

# tipsShareDetailExportImageTitle
source: Export to image
de: Als Bild exportieren
es: Exportar como imagen
fr: Exporter en tant qu'image
hi: इमेज के रूप में निर्यात
it: Esporta come immagine
ja: 画像としてエクスポート
ko: 이미지로 내보내기
nl: Exporteren als afbeelding
pl: Eksport jako obraz
pt: Exportar como imagem
ru: Экспорт в виде изображения
th: ส่งออกเป็นรูปภาพ
tr: Görüntü olarak dışa aktar
vi: Xuất dưới dạng hình ảnh
zh_hans: 导出为图片
zh_hant: 匯出為影像

# tipsShareDetailExportPDFContent
source: ExcalidrawZ also supports exporting your drawings as vector PDFs. This ensures that the exported image remains lossless, no matter how much you zoom in. - **How to access** Open the **Share** panel and select the **PDF** option. - **Export process** This will open the system print dialog. From here, you can either: - Print the file directly - Choose *Export to PDF* to save a lossless PDF version
de: ExcalidrawZ unterstützt außerdem den Export deiner Zeichnungen als Vektor-PDFs. Dadurch bleibt das exportierte Bild verlustfrei, ganz gleich, wie weit du hineinzoomst. - **Zugriff** Öffne das **Teilen**-Panel und wähle die **PDF**-Option. - **Exportvorgang** Dadurch wird der Systemdruckdialog geöffnet. Von hier aus kannst du entweder: - die Datei direkt drucken - *Als PDF exportieren* wählen, um eine verlustfreie PDF-Version zu speichern
es: ExcalidrawZ también permite exportar tus dibujos como PDF vectoriales. Esto garantiza que la imagen exportada no pierda calidad, sin importar cuánto aumentes el zoom. - **Cómo acceder** Abre el panel **Compartir** y selecciona la opción **PDF**. - **Proceso de exportación** Esto abrirá el diálogo de impresión del sistema. Desde aquí, puedes: - Imprimir el archivo directamente - Elegir *Exportar a PDF* para guardar una versión PDF sin pérdida
fr: ExcalidrawZ prend également en charge l'exportation de vos dessins au format PDF vectoriel. Cela garantit que l'image exportée reste sans perte, quel que soit le niveau de zoom. - **Comment y accéder** Ouvrez le panneau **Partager** et sélectionnez l'option **PDF**. - **Processus d'exportation** Cela ouvrira la boîte de dialogue d'impression du système. À partir de là, vous pouvez soit : - Imprimer le fichier directement - Choisir *Exporter au format PDF* pour enregistrer une version PDF sans perte
hi: ExcalidrawZ आपके ड्राइंग्स को वेक्टर PDF के रूप में भी निर्यात करने का समर्थन करता है। इससे निर्यात की गई छवि लॉसलेस रहती है, चाहे आप कितनी भी ज़ूम कर लें। - **पहुंचने का तरीका** **साझा** पैनल खोलें और **PDF** विकल्प चुनें। - **निर्यात प्रक्रिया** इससे सिस्टम प्रिंट डायलॉग खुलेगा। यहाँ से आप या तो: - फ़ाइल को सीधे प्रिंट करें - *PDF के रूप में निर्यात करें* चुनें ताकि लॉसलेस PDF वर्शन सेव हो सके
it: ExcalidrawZ supporta anche l'esportazione dei tuoi disegni come PDF vettoriali. Questo garantisce che l'immagine esportata rimanga senza perdita di qualità, indipendentemente dallo zoom. - **Come accedere** Apri il pannello **Condividi** e seleziona l'opzione **PDF**. - **Processo di esportazione** Questo aprirà la finestra di stampa di sistema. Da qui puoi: - Stampare il file direttamente - Scegliere *Esporta in PDF* per salvare una versione PDF senza perdita di qualità
ja: ExcalidrawZは図面をベクタPDFとしてエクスポートすることもサポートしています。これにより、どれだけ拡大しても出力画像が劣化しません。 - **アクセス方法** **共有**パネルを開き、**PDF**オプションを選択します。 - **エクスポートの手順** これによりシステムの印刷ダイアログが開きます。ここから次のいずれかを選べます： - ファイルを直接印刷する - *PDFとしてエクスポート* を選択して、劣化のないPDFを保存する
ko: ExcalidrawZ는 도면을 벡터 PDF로 내보내는 것도 지원합니다. 이렇게 내보내면 아무리 확대해도 이미지가 손실되지 않습니다. - **접근 방법** **공유** 패널을 열고 **PDF** 옵션을 선택하세요. - **내보내기 과정** 시스템 인쇄 대화상자가 열립니다. 여기에서 다음 중 하나를 선택할 수 있습니다: - 파일을 직접 인쇄 - *PDF로 내보내기*를 선택하여 손실 없는 PDF 버전을 저장
nl: ExcalidrawZ ondersteunt ook het exporteren van je tekeningen als vector-PDF's. Dit zorgt ervoor dat de geëxporteerde afbeelding verliesvrij blijft, ongeacht hoe ver je inzoomt. - **Hoe toegang krijgen** Open het **Delen**-paneel en kies de optie **PDF**. - **Exportproces** Dit opent het systeemafdrukvenster. Vanaf hier kun je: - Het bestand direct afdrukken - Kies *Exporteren naar PDF* om een verliesloze PDF-versie op te slaan
pl: ExcalidrawZ obsługuje również eksport rysunków do wektorowych plików PDF. Dzięki temu wyeksportowany obraz pozostaje bezstratny, niezależnie od stopnia powiększenia. - **Jak uzyskać dostęp** Otwórz panel **Udostępnij** i wybierz opcję **PDF**. - **Proces eksportu** Spowoduje to otwarcie systemowego okna dialogowego drukowania. Stąd możesz: - Wydrukować plik bezpośrednio - Wybrać *Eksportuj do PDF*, aby zapisać bezstratną wersję PDF
pt: O ExcalidrawZ também oferece suporte para exportar seus desenhos como PDFs vetoriais. Isso garante que a imagem exportada permaneça sem perdas, não importa quanto você dê zoom. - **Como acessar** Abra o painel **Compartilhar** e selecione a opção **PDF**. - **Processo de exportação** Isso abrirá a caixa de diálogo de impressão do sistema. A partir daqui, você pode: - Imprimir o arquivo diretamente - Escolher *Exportar para PDF* para salvar uma versão em PDF sem perdas
ru: ExcalidrawZ также поддерживает экспорт ваших рисунков в виде векторных PDF. Это гарантирует, что экспортированное изображение останется без потерь независимо от уровня масштабирования. - **Как получить доступ** Откройте панель **Поделиться** и выберите опцию **PDF**. - **Процесс экспорта** Откроется системный диалог печати. Отсюда вы можете: - Напечатать файл напрямую - Выбрать *Экспорт в PDF*, чтобы сохранить версию PDF без потерь
th: ExcalidrawZ ยังรองรับการส่งออกภาพวาดของคุณเป็นไฟล์ PDF แบบเวกเตอร์ ซึ่งทำให้ภาพที่ส่งออกไม่มีการสูญเสียคุณภาพ ไม่ว่าคุณจะซูมเข้าเท่าใด。 - **How to access** เปิดแผง **แชร์** แล้วเลือกตัวเลือก **PDF**。 - **Export process** จะเป็นการเปิดกล่องโต้ตอบการพิมพ์ของระบบ จากที่นี่ คุณสามารถ: - พิมพ์ไฟล์โดยตรง - เลือก *ส่งออกเป็น PDF* เพื่อบันทึกไฟล์ PDF แบบไม่มีการสูญเสียคุณภาพ
tr: ExcalidrawZ ayrıca çizimlerinizi vektörel PDF olarak dışa aktarmayı destekler. Bu, ne kadar yakınlaştırırsanız yakınlaştırın dışa aktarılan görüntünün kayıpsız kalmasını sağlar. - **Erişim nasıl sağlanır** **Paylaş** panelini açın ve **PDF** seçeneğini seçin. - **Dışa aktarma işlemi** Bu, sistem yazdırma iletişim kutusunu açacaktır. Buradan ya: - Dosyayı doğrudan yazdırabilirsiniz - Kayıpsız bir PDF sürümü kaydetmek için *PDF olarak dışa aktar* seçeneğini kullanabilirsiniz
vi: ExcalidrawZ cũng hỗ trợ xuất bản vẽ của bạn dưới dạng PDF vector. Điều này đảm bảo hình ảnh xuất ra giữ nguyên chất lượng, không bị mất mát dù bạn phóng to tới mức nào. - **Cách truy cập** Mở bảng **Chia sẻ** và chọn tùy chọn **PDF**. - **Quy trình xuất** Việc này sẽ mở hộp thoại in của hệ thống. Từ đây, bạn có thể: - In file trực tiếp - Chọn *Xuất sang PDF* để lưu bản PDF không mất chất lượng
zh_hans: ExcalidrawZ 还支持将绘图导出为矢量 PDF。这可确保导出图像保持无损，无论放大多少。 - **如何访问** 打开 **Share（分享）** 面板，选择 **PDF** 选项。 - **导出流程** 这会打开系统的打印对话框。在此，您可以： - 直接打印文件 - 选择 *Export to PDF*（导出为 PDF）以保存无损的 PDF 版本
zh_hant: ExcalidrawZ 也支援將你的圖稿匯出為向量（vector）PDF，確保匯出檔案在放大時仍保持無損。 - **如何存取** 開啟 **Share（分享）** 面板並選擇 **PDF** 選項。 - **匯出流程** 這會開啟系統的列印對話方塊。接著，你可以： - 直接列印檔案 - 選擇 *Export to PDF*（匯出為 PDF）以儲存無損的 PDF 檔

# tipsShareDetailExportPDFTitle
source: Export to lossless PDF
de: Als verlustfreie PDF exportieren
es: Exportar a PDF sin pérdida
fr: Exporter en PDF sans perte
hi: लॉसलेस PDF के रूप में निर्यात
it: Esporta in PDF senza perdita di qualità
ja: ロスレスPDFにエクスポート
ko: 손실 없는 PDF로 내보내기
nl: Exporteren naar verliesloze PDF
pl: Eksport do bezstratnego PDF
pt: Exportar para PDF sem perdas
ru: Экспорт в PDF без потерь
th: ส่งออกเป็น PDF แบบไม่สูญเสียคุณภาพ
tr: Kayıpsız PDF olarak dışa aktar
vi: Xuất sang PDF không mất chất lượng
zh_hans: 导出为无损 PDF
zh_hant: 匯出為無損 PDF

# tipsShareDetailTitle
source: Sharing Your Work in ExcalidrawZ
de: Deine Arbeit in ExcalidrawZ teilen
es: Compartir tu trabajo en ExcalidrawZ
fr: Partager votre travail dans ExcalidrawZ
hi: ExcalidrawZ में अपना काम साझा करना
it: Condividere il tuo lavoro in ExcalidrawZ
ja: ExcalidrawZでの作品の共有
ko: ExcalidrawZ에서 작업 공유하기
nl: Je werk delen in ExcalidrawZ
pl: Udostępnianie pracy w ExcalidrawZ
pt: Compartilhando seu trabalho no ExcalidrawZ
ru: Как поделиться своей работой в ExcalidrawZ
th: การแชร์งานของคุณใน ExcalidrawZ
tr: ExcalidrawZ'de Çalışmalarınızı Paylaşma
vi: Chia sẻ công việc của bạn trong ExcalidrawZ
zh_hans: 在 ExcalidrawZ 中分享您的作品
zh_hant: 在 ExcalidrawZ 中分享你的作品

# tipsShareOverviewDescription
source: Share your drawings with others.
de: Teile deine Zeichnungen mit anderen.
es: Comparte tus dibujos con otras personas.
fr: Partagez vos dessins avec d'autres personnes.
hi: अपनी ड्राइंग्स दूसरों के साथ साझा करें।
it: Condividi i tuoi disegni con gli altri.
ja: 作成した図を他の人と共有できます。
ko: 도면을 다른 사람들과 공유하세요.
nl: Deel je tekeningen met anderen.
pl: Udostępnij swoje rysunki innym.
pt: Compartilhe seus desenhos com outras pessoas.
ru: Делитесь своими рисунками с другими.
th: แชร์ภาพวาดของคุณกับผู้อื่น
tr: Çizimlerinizi başkalarıyla paylaşın.
vi: Chia sẻ bản vẽ của bạn với người khác.
zh_hans: 与他人分享您的绘图。
zh_hant: 與他人分享你的圖稿。

# tipsShareOverviewTitle
source: Share
de: Teilen
es: Compartir
fr: Partager
hi: साझा
it: Condividi
ja: 共有
ko: 공유
nl: Delen
pl: Udostępnianie
pt: Compartilhar
ru: Поделиться
th: แชร์
tr: Paylaş
vi: Chia sẻ
zh_hans: 分享
zh_hant: 分享

# tipsWhatsNewOverviewTitle
source: What’s New
de: Neuigkeiten
es: Novedades
fr: Nouveautés
hi: क्या नया है
it: Novità
ja: 新機能
ko: 새로운 기능
nl: Wat is er nieuw
pl: Co nowego
pt: Novidades
ru: Что нового
th: มีอะไรใหม่
tr: Yenilikler
vi: Có gì mới
zh_hans: 新功能
zh_hant: 新功能

# aiChatButtonMCPSettings
source: MCP
hi: एमसीपी
ru: МCP

# settingsAIMCPConnectionGuideVSCodeTabTitle
source: VS Code
hi: VS कोड
ko: VS 코드
